Revit 2027 API
BuiltInFailures.DetailFailures Class
 Failures about Detail.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DetailFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DetailFailures
Public NotInheritable Class DetailFailures
public ref class DetailFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DetailFailures = class end
The BuiltInFailures.DetailFailures type exposes the following members.
Properties
Name | Description
EavesAreAligned |  All eaves are already aligned.
NeedsTwoToAlignEaves |  At least two Slope Defining Lines are needed to perform Align Eaves.
RepeatingDetailSpacingZeroError |  Spacing must be greater than 0
Top
See Also
Reference
Autodesk.Revit.DB Namespace